'''
Напишите программу, которая считывает строку с числом nn, которое задаёт количество чисел, которые
нужно считать. Далее считывает nn строк с числами x_ix 
i, по одному числу в каждой строке. Итого будет n+1n+1 строк. При считывании числа x_ix i​
программа должна на отдельной строке вывести значение f(x_i)f(x 
i​ ). Функция f(x) уже реализована и доступна для вызова. Функция вычисляется достаточно
долго и зависит только от переданного аргумента xx. Для того, чтобы уложиться в ограничение
по времени, нужно избежать повторного вычисления значений.
Sample Input:

5
5
12
9
20
12
Sample Output:

11
41
47
61
41
'''


n = int(input())
ndict = {}
for xi in range(n):
    a = int(input())
    if a in ndict:
        print(ndict[a])
    else:
        ndict[a] = f(a)
        print(f(a))
        print(ndict)
